In [1]:
pip install sqlite3

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement sqlite3 (from versions: none)
ERROR: No matching distribution found for sqlite3

In [1]:
import sqlite3
import pandas as pd

In [39]:
import pandas as pd

In [113]:
con = sqlite3.connect('Downloads/drive/Customer1.xlsx')

In [114]:
crsr = con.cursor()

In [14]:
df = pd.read_excel('Downloads/drive/Customer.xlsx')

In [15]:
df

   custemor_id cust_name      city  grade  salesman
0         3002    roshan      pune    100      5001
1         3007    sameer      pune    200      5001
2         3005      josh    mumbai    200      5002
3         3008     ajeem    nagpur    300      5002
4         3004      ravi    jaipur    300      5006
5         3009     pooja   kolkata    100      5003
6         3003      atul  banglore    200      5007
7         3001       tom     delhi    400      5005

In [17]:
df.to_sql(name='Customer', con=con)

In [24]:
sql_statement = """SELECT * FROM Customer ORDER BY grade"""

In [25]:
crsr.execute(sql_statement)

In [26]:
print(crsr.fetchall())

[(0, 3002, 'roshan', 'pune', 100, 5001), (5, 3009, 'pooja', 'kolkata', 100, 5003), (1, 3007, 'sameer', 'pune', 200, 5001), (2, 3005, 'josh', 'mumbai', 200, 5002), (6, 3003, 'atul', 'banglore', 200, 5007), (3, 3008, 'ajeem', 'nagpur', 300, 5002), (4, 3004, 'ravi', 'jaipur', 300, 5006), (7, 3001, 'tom', 'delhi', 400, 5005)]

In [28]:
df = pd.read_csv('Downloads/Dataset1/Dataset/Salesman.csv')

In [29]:
df

   salesman_id    name      city  commision
0         5001  ashish    mumbai       0.15
1         5002    amol  amritsar       0.13
2         5005  ritesh     delhi       0.11
3         5006  rajesh      pune       0.14
4         5003   omkar    jaipur       0.12
5         5007    abhi    nagpur       0.13

In [31]:
df.to_sql(name='Salesman', con=con)

In [110]:
sql_statement = """SELECT MAX(commision) FROM Salesman"""

In [111]:
crsr.execute(sql_statement)

ProgrammingError: Cannot operate on a closed database.

In [34]:
print(crsr.fetchall())

[(0.15,)]

In [50]:
df = pd.read_csv('Downloads/Dataset1/Dataset/Orders.csv',encoding_errors = 'ignore')

In [51]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  05-10-2012         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  05-10-2012         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  10-09-2012         3005         5002
5    70005    2400.60  27-07-2012         3007         5001
6    70008    5760.00  10-09-2012         3002         5001
7    70010    1983.43  10-10-2012         3004         5006
8    70003    2480.40  10-10-2012         3009         5003
9    70012     250.45  27-06-2012         3008         5002
10   70011      75.29  17-08-2012         3003         5007
11   70013    3045.60  25-04-2012         3002         5001

In [52]:
df.to_sql(name='Orders', con=con)

In [56]:
sql_statement = """SELECT ord_no, purch_amt, ord_date, salesman_id  FROM Orders WHERE salesman_id IN (SELECT salesman_id FROM salesman WHERE city = 'nagpur');"""

In [57]:
crsr.execute(sql_statement)

In [58]:
print(crsr.fetchall())

[(70011, 75.29, '17-08-2012', 5007)]

In [ ]:
select *from getLastRecord ORDER BY id DESC LIMIT 1;

In [74]:
sql_statement = """SELECT purch_amt FROM Orders ORDER BY ord_no DESC LIMIT 2,1;"""

In [75]:
crsr.execute(sql_statement)

In [76]:
print(crsr.fetchall())

[(75.29,)]

ENTITIES 
customer_name,customer_id,Account_Number,Account_status,Account_type,Balance_amount,Transaction_amount,Transcation_channel,Transaction_Date,purch_am

In [83]:
df = pd.read_csv('Downloads/Dataset1/Dataset/Bank_Account_Details.csv')

In [85]:
df

,Customer_id,Account_Number,Account_type,Balance_amount,Account_status,Relationship_type
0,123001,4000-1956-3456,SAVINGS,200000,ACTIVE,P
1,123001,5000-1700-3456,RECURRING DEPOSITS,9400000,ACTIVE,S
2,123002,4000-1956-2001,SAVINGS,400000,ACTIVE,P
3,123002,5000-1700-5001,RECURRING DEPOSITS,7500000,ACTIVE,S
4,123003,4000-1956-2900,SAVINGS,750000,INACTIVE,P
5,123004,5000-1700-6091,RECURRING DEPOSITS,7500000,ACTIVE,S
6,123004,4000-1956-3401,SAVINGS,655000,ACTIVE,P
7,123005,4000-1956-5102,SAVINGS,300000,ACTIVE,P
8,123006,4000-1956-5698,SAVINGS,455000,ACTIVE,P
9,123007,5000-1700-9800,SAVINGS,355000,ACTIVE,P
10,123007,4000-1956-9977,RECURRING DEPOSITS,7025000,ACTIVE,S
11,123007,9000-1700-7777-4321,Credit Card,0,INACTIVE,P
12,123007,5900-1900-9877-5543,Add-on Credit Card,0,ACTIVE,S
13,123008,5000-1700-7755,SAVINGS,0,INACTIVE,P
14,123006,5800-1700-9800-7755,Credit Card,0,ACTIVE,P
15,123006,5890-1970-7706-8912,Add-on Credit Card,0,ACTIVE,S

In [86]:
df.to_sql(name='Bank_Account_Details', con=con)

In [88]:
df = pd.read_csv('Downloads/Dataset1/Dataset/BANK_ACCOUNT_TRANSACTION.csv')

In [90]:
df

,Account_Number,Transaction_amount,Transcation_channel,Province,Transaction_Date
0,4000-1956-3456,-2000.0,ATM withdrawl,CA,2020-01-13
1,4000-1956-2001,-4000.0,POS-Walmart,MN,2020-02-14
2,4000-1956-2001,-1600.0,UPI transfer,MN,2020-01-19
3,4000-1956-2001,-6000.0,Bankers cheque,CA,2020-03-23
4,4000-1956-2001,-3000.0,Net banking,CA,2020-04-24
5,4000-1956-2001,23000.0,cheque deposit,MN,2020-03-15
6,5000-1700-6091,40000.0,ECS transfer,NY,2020-02-19
7,5000-1700-7791,40000.0,ECS transfer,NY,2020-02-19
8,4000-1956-3401,8000.0,Cash Deposit,NY,2020-01-19
9,4000-1956-5102,-6500.0,ATM withdrawal,NY,2020-03-14
10,4000-1956-5698,-9000.0,Cash Deposit,NY,2020-03-27
11,4000-1956-9977,50000.0,ECS transfer,NY,2020-01-16
12,9000-1700-7777-4321,-5000.0,POS-Walmart,NY,2020-02-17
13,9000-1700-7777-4321,-8000.0,Shopping Cart,MN,2020-03-13
14,9000-1700-7777-4321,-2500.0,Shopping Cart,MN,2020-04-21
15,5800-1700-9800-7755,-9000.0,POS-Walmart,MN,2020-04-13
16,5890-1970-7706-8912,-11000.0,Shopping Cart,NY,2020-03-12

In [89]:
df.to_sql(name='BANK_ACCOUNT_TRANSACTION',con=con)

In [95]:
df = pd.read_csv('Downloads/Dataset1/Dataset/Bank_customer.csv')

In [96]:
df

   customer_id customer_name              Address state_code   Telephone
0       123001        Oliver    225-5, Emeryville         CA  1897614500
1       123002        George   194-6,New brighton         MN  1897617000
2       123003         Harry  2909-5,walnut creek         CA  1897617866
3       123004          Jack       229-5, Concord         CA  1897627999
4       123005         Jacob  325-7, Mission Dist        SFO  1897637000
5       123006          Noah    275-9, saint-paul         MN  1897613200
6       123007       Charlie      125-1,Richfield         MN  1897617666
7       123008         Robin      3005-1,Heathrow         NY  1897614000

In [97]:
df.to_sql(name='Bank_customer', con=con)

In [100]:
sql_statement = """Select Customer_id,Account_Number,Case when ifnull(Balance_amount,0) = 0 then Transaction_amount else Balance_amount end as Balance_amount
from Bank_Account_Details inner join BANK_ACCOUNT_TRANSACTION on Account_Number = Account_Number and Account_type = "Credit Card";"""

In [101]:
crsr.execute(sql_statement)

OperationalError: ambiguous column name: Account_Number

In [102]:
con.commit()

In [103]:
con.close()